#include <stdio.h>

void printPartI() {
    /**
     * Выполните операции и выведите результаты:
     * 25 + 35; 12.78 + 18.22; 21.35 + 15
     */
    printf(
        "%d %.f %.2f\n",
        25 + 35,
        12.78 + 18.22,
        21.35 + 15
    );
    /**
     *17 − 6; 25 − 42; 21 − 13.54
     */
    printf(
        "%d %d %.2f\n",
        17 - 6,
        25 - 42,
        21 - 13.54
    );
    /**
     *65 * 3; 3.14 * 2.71; 9.8 * 4
     */
    printf(
        "%d %.2f %.1f\n",
        65 * 3,
        3.14 * 2.71,
        9.8 * 4
    );
    /**
     *32 / 2; 35 / 2; 16.8 / 4; 20 / 2.5
     */
    /**
     *Найдите остаток от деления: 12 на 4; 15 на 4; 27 на 3; 21.4 на 4.
     */
    const int y = (int) 21.4;

    printf(
        "%d %d %d %.1f\n",
        12 % 4,
        15 % 4,
        27 % 3,
        21.4 - y + y % 4
    );
}

void printPartII() {
    /**
     *Выполните поразрядные операции и выведите результаты:
     *12 ИЛИ 5, 8 ИЛИ 7, 24 ИЛИ 64
     */
    printf(
        "%d %d %d\n",
        12 | 5,
        8 | 7,
        24 | 64
    );
    /**
     *27 И 3, 16 И 0, 32 И 1
     */
    printf(
        "%d %d %d\n",
        27 & 3,
        16 & 0,
        32 & 1
    );
    /**
     *5 искл. ИЛИ 6, 5 искл. ИЛИ 5, 8 искл. ИЛИ 0
     */
    printf(
        "%d %d %d\n",
        5 ^ 6,
        5 ^ 5,
        8 ^ 0);
    /**
     *6 НЕ 1, 1 НЕ 1, 0 НЕ 0
     */
    printf(
        "%d %d %d\n",
        6 != 1,
        1 != 1,
        0 != 0
    );
}

void printPartIII() {
    const int a = (int) (72.45 + 84.32);
    const float b = (float) (44.32 + 51.54);
    const float b1 = (float) (53 + 2.54);
    const float b2 = (float) (12 + 22);
    const int a1 = (int) 64.2154;
    const float a2 = (float) 42;
    printf("%d %.2f %.2f %.f %d %.f", a, b, b1, b2, a1, a2);
}

void main() {
    printPartI();
    printf("----\n");
    printPartII();
    printf("----\n");
    printPartIII();
}
